{
  "en": "En",
  "ru": "Ru",
  "index.title": "реактивный фронтэнд инженер",
  "home": "Главная",
  "about": "Обо мне",
  "resume": "Резюме",
  "projects": "Проекты",
  "experiments": "Эксперименты",
  "contact": "Контакты",
  "contact_work": "О серьезном",
  "contact_friends": "Обо всем",
  "next": "Следующий",
  "prev": "Предыдущий",
  "back": "Назад",
  "about.part1": "Дорогой гость,<br />Рада встрече! Привет из Сан-Франциско!",
  "about.part2": "Did I promise to tell about myself if you visit my web page? Let’s get started!",
  "about.part3": "The story of my relationships with web technologies begins in the distant 1999. When I created my first HTML-page about cats for programming class in the middle school. That page was awesome. I got a five for diligence and left to grow up. In 2008 we met again. But this time it was a serious long-term partnership.",
  "about.part4": "Since that time I've seen a lot. Battle of table and div layouts. I fought for divs. Carefully glued image sprites to create rounded borders. Yes, I was dreaming about border-radius for so long. I saw the dawn and sunset of jQuery. I remember how all script tags were moved from the head to the end of body all around the web. Bragged to server developers with my application on Express.",
  "about.part5": "In mid-2012, I was bored and I plunged into the world of server Java development. After 6 months of debugging errors in the console, I decided to test the sass, Backbone, and grunt. After that, I could not find the strength to come back.",
  "about.part6": "Todays I would love to create PWA and score 100 points on Google Lighthouse, write an app about barware (or whatever ware)) using React-native. And find a dream team to work together on great projects!",
  "nomatch.head": "Простите, по этому адресу ничего не найдено",
  "nomatch.link_back": "Вернуться",
  "techstack": "Навыки",
  "experience": "Опыт",
  "education": "Образование",
  "pm": "Менеджер проектов",
  "frontend_developer": "Фронтэнд разработчик",
  "web_developer": "Веб-разработчик",
  "html_developer": "HTML developer",
  "resume.to_present": "по сей день",
  "moscow": "Москва, Россия",
  "spb": "Санкт-Петербург, Россия",
  "ufa": "Уфа, Россия",
  "alx_1": "Successfully implemented Agile methodology in distributed, multiple time zones team",
  "alx_2": "Managed all phases of the product development for dozens of custom solutions",
  "alx_3": "Guided team in the development of SPA",
  "alx_4": "Created education tech program for managers and graphic designers (web development basics, working with git, node.js, webpack, Jenkins)",
  "alx_about": "ADLUXE - creative technologies, Rich Media and Video Advertising Production",
  "mail_1": "Developed frontend for a Skyforge MMORPG social network. Created features integrated with core game’s systems",
  "mail_2": "Cross platform development for desktop, mobile, in-game (awesomium)",
  "mail_3": "Made 3 global redesigns of the product. Created custom css-framework",
  "mail_4": "Lead UI/UX testing",
  "mail_5": "Managed all frontend development (code style, code structure, style guides)",
  "mail_6": "Tech stack: tapestry framework (Java) with react.",
  "mail_about": "Mail.Ru Group is the largest Internet company in the Russian-speaking world and the leading Internet company in Russia, based on global monthly unique users.",
  "ifree_1": "Made dozens sites, landings, email newsletters, mobile portals using PHP",
  "ifree_2": "Developed admin web applications for managing advertisement campaigns using Ruby on Rails",
  "ifree_3": "Java EE: Web applications (front-end, back-end) using Spring MVC (Maven, JPA, JSP).",
  "ifree_about": "i-Free Group includes more than 20 IT-tech companies and start-ups focuses on mobile technology.",
  "simai_1": "Worked on corporate portals for public administrations",
  "simai_2": "TML/CSS/JS coding of web pages, improvement and optimization of existing interfaces, layout templates for 1C Bitrix.",
  "simai_about": "Digital studio «Simai» lead in the market of information solutions in Ufa, Russia",
  "usatu": "Ufa State Aviation Technical University",
  "usatu.edu": "Engineer / Master of telecommunication systems",
  "usatu.descr": "USATU is one of the leading institutions of higher education in Russia",
  "cisco.title": "CISCO networking academy",
  "cisco.part1": "Networking for home and small businesses",
  "cisco.part2": "Working at a small-to-medium business or ISP",
  "ifree.academy.title": "ifree TEchnical academy",
  "ifree.academy.part1": "Developing products from scratch",
  "ifree.academy.part2": "Won the place education among 150 others participants",
  "ifree.academy.part3": "Won the first prize in a team competition among 10 others team for investing",
  "design.academy.title": "Graphic Design BOOTCAMP",
  "design.academy.part1": "10 weeks course: graphic design in web",
  "design.academy.part2": "Effective designs principles, theory and practice",
  "skyforge.title": "Skyforge MMORPG",
  "korsa.title": "Корса Медиа",
  "sf.about": "Skyforge is a free-to-play MMORPG set in a universe where fantasy and Sci-Fi collide. Players start as immortals trying to become mighty gods while protecting their planet, Aelion.",
  "korsa.about": "Korsa Media - организатор массовых спортивно-развлекательных мероприятий",
  "desktop": "Широкоформатная версия",
  "mobile": "Мобильная версия",
  "live_preview": "Превью проекта",
  "rg-weather.title": "Прогноз погоды",
  "rg-weather.about": "",
  "rg-youtube.title": "Forecast app",
  "rg-youtube.about": "Forecast for the next 7 days. Any city around the world. Build with Yahoo Weather. Flat design for city cards with background picture from Google Places or Flickr."

}