{
  "en": "En",
  "ru": "Ru",
  "index.title": "реактивный фронтэнд инженер",
  "home": "Главная",
  "about": "Обо мне",
  "welcome": "Приветствую",
  "resume": "Резюме",
  "projects": "Проекты",
  "experiments": "Эксперименты",
  "contact": "Контакты",
  "contact_work": "О серьезном",
  "contact_friends": "Обо всем",
  "contract": "Контракт",
  "next": "Следующий",
  "prev": "Предыдущий",
  "back": "Назад",
  "month.may": "Май",
  "month.august": "Август",
  "month.september": "Сентябрь",
  "month.december": "Декабрь",
  "about.part1": "Дорогой гость,<br />Рада встрече! Привет из Оакланда, Бэй Ареа!",
  "about.part2": "Did I promise to tell about myself if you visit my web page? Let’s get started!",
  "about.part3": "The story of my relationships with web technologies begins in the distant 1999. When I created my first HTML-page about cats for programming class in the middle school. That page was awesome. I got a five for diligence and left to grow up. In 2008 we met again. But this time it was a serious long-term partnership.",
  "about.part4": "Since that time I've seen a lot. Battle of table and div layouts. I fought for divs. Carefully glued image sprites to create rounded borders. Yes, I was dreaming about border-radius for so long. I saw the dawn and sunset of jQuery. I remember how all script tags were moved from the head to the end of body all around the web. Bragged to server developers with my application on Express.",
  "about.part5": "In mid-2012, I was bored, so I plunged into the world of server Java development. After six months of debugging errors in the console, I decided to test the Sass, Backbone, and Grunt. After that, I could not find the strength to come back.",
  "about.part6": "The further, the better. Single page application conquered the world. I couldn't resist the beauty of React's virtual DOM neither did the rest of the tech world.",
  "about.part7": "Todays I would love to continue solving real-life problems,  explore new technologies and concepts,  make my brain burn while working on complex features. And find a dream team to reach new heights together!",
  "nomatch.head": "Простите, по этому адресу ничего не найдено",
  "nomatch.link_back": "Вернуться",
  "techstack": "Навыки",
  "techstack_2": "Окружение",
  "experience": "Опыт",
  "education": "Образование",
  "teamLead": "Руководитель Разработки",
  "frontend_developer": "Фронтэнд Разработчик",
  "senior_frontend_developer": "Старший Фронтэнд Разработчик",
  "web_developer": "Веб Разработчик",
  "resume.to_present": "по сей день",
  "moscow": "Москва, Россия",
  "spb": "Санкт-Петербург, Россия",
  "sf": "Сан-Франциско, США",
  "ufa": "Уфа, Россия",
  "presence_1": "Developed a client portal for investment company from scratch (set up ui infrastructure and tech stack)",
  "presence_2": "Feature owner (front end):",
  "presence_2_1": "authentication and user roles",
  "presence_2_2": "dynamic routing with progressive enhancement",
  "presence_2_3": "custom layouts for private and public routes",
  "presence_2_4": "dynamic custom area/pie/bar charts",
  "presence_3": "Tech stack: React, Redux, Recharts, Webpack",
  "presence_about": "Software development agency focused on web, mobile, VR, AR, Salesforce",
  "fr8_1": "Feature owner (front end):",
  "fr8_1_1": "request-for-quote flow (entry point for shippers), shipper registration",
  "fr8_1_2": "rate calculator for shippers, rate calculator widget for partners",
  "fr8_1_3": "load matcher (entry point for carriers)",
  "fr8_2": "Worked on API-designs, performance optimization, 3rd-party API integration",
  "fr8_3": "Global UI-acrhitecture, reusable responsive components library, style guides",
  "fr8_4": "Tech stack: React, MobX, Google Maps API, Node, Swagger",
  "fr8_about": "FR8Star - Load board, freight matching, and bidding marketplace",
  "alx_1": "Led the development of 10+ of company products",
  "alx_2": "Successfully implemented Agile methodology in a distributed, multi-timezone team",
  "alx_3": "Moved company website from PHP to React single page app",
  "alx_4": "Guided team in the development of SPA",
  "alx_5": "Created an education tech program for managers and designers (dev fundamentals, js, git, webpack, Jenkins)",
  "alx_about": "ADLUXE - Creative technologies, Rich Media and Video Advertising Production",
  "mail_1": "Led UI development (code style, code structure, style guides)",
  "mail_2": "Cross platform development for desktop, mobile, in-game (awesomium) from scratch",
  "mail_3": "Released 3 global redesigns of the product. Implemented company style guide",
  "mail_4": "Lead UI/UX testing",
  "mail_5": "Tech stack: Java (Tapestry), JS (React, Jquery)",
  "mail_about": "Mail.Ru Group - The leading Russian Internet company with 100M+ users",
  "ifree_1": "Launched 20+ sites, landings, email newsletters, promo pages (PHP)",
  "ifree_2": "Developed admin web applications for managing advertisement campaigns using Ruby on Rails",
  "ifree_3": "Java EE: Web applications (front end, back end) using Spring MVC (Maven, JPA, JSP)",
  "ifree_about": "i-Free Group - Mobile App development & distribution company with $250M year revenue",
  "simai_1": "HTML/CSS/JS coding of web pages, performance optimization, CMS layout templates",
  "simai_about": "Digital studio «Simai» lead in the market of information solutions in Ufa, Russia",
  "usatu": "Ufa State Aviation Technical University",
  "usatu.edu": "Engineer / Master of telecommunication systems",
  "usatu.descr": "USATU is one of the leading institutions of higher education in Russia",
  "cisco.title": "CISCO networking academy",
  "cisco.part1": "Networking for home and small businesses",
  "cisco.part2": "Working at a small-to-medium business or ISP",
  "ifree.academy.title": "ifree TEchnical academy",
  "ifree.academy.part1": "Was among TOP 20% of chosen to participate in the Academy",
  "ifree.academy.part2": "Took the 1st place among 10 other projects",
  "design.academy.title": "Graphic Design BOOTCAMP",
  "design.academy.part1": "10 weeks course: graphic design in web",
  "design.academy.part2": "Effective designs principles, fonts, layouts, theory and practice",
  "skyforge.title": "Skyforge MMORPG",
  "sf.about": "Skyforge is a free-to-play MMORPG set in a universe where fantasy and Sci-Fi collide. Players start as immortals trying to become mighty gods while protecting their planet, Aelion.",
  "korsa.title": "Корса Медиа",
  "korsa.1": "This project is the result of collaboration with Nebula Digital team",
  "korsa.2": "Involved in all stages of the lifecycle including requirement gathering, design, development, testing and deployment",
  "korsa.3": "Developed frontend part of the project in a short time",
  "korsa.4": "Mobile friendly responsive layout",
  "korsa.about": "Korsa Media - организатор массовых спортивно-развлекательных мероприятий",
  "desktop": "Десктоп версия",
  "mobile": "Мобильная версия",
  "live_preview": "Превью проекта",
  "rg-weather.title": "Прогноз погоды",
  "rg-weather.about": "",
  "rg-youtube.title": "Forecast app",
  "rg-youtube.about": "Forecast for the next 7 days. Any city around the world. Build with Yahoo Weather. Flat design for city cards with background picture from Google Places or Flickr.",
  "dragons.title": "Dragon It!",
  "dragons.about": "",
  "dragon.1" : "Worked extensively on creating full promo pack: landing page, mobile promo and email newsletter",
  "dragon.2" : "Was responsible for maintaining, expanding and scaling the web application",
  "dragon.3" : "Implemented parallax background and video player",
  "lumene.title": "Lumene Finland",
  "lumene.about": "Web site with seasonal events, discounts, promotions",
  "lumene.1" : "Developed frontend part of promo web application with full browser support (IE6 included)",
  "lumene.2" : "Implemented feedback form using PHP",
  "madcall.title": "MadCall Me",
  "madcall.about": "Madcall.me is a mobile service and application, that changes user's voice on the phone while talking. All users need to do is pick a voice, decide who they want to call and start having fun.",
  "madcall.1": "Created promo page for the first version of app",
  "madcall.2": "Responsive layout",
  "madcall.3": "Parallax background",
  "zombie.title": "Dragon It!",
  "zombie.about": "Project made in I-FREE Academy. Multi-player survival game for iOS with promo page.",
  "daosulta.title": "Personal portfolio",
  "daosulta.about": "Personal portfolio project made in 2013. The main goal was to implement landing page with trending (at that time) features.",
  "daosulta.1": "Responsive layout with media queries",
  "daosulta.2": "CSS animations and transforms",
  "daosulta.3": "Mobile friendly navigation",
  "daosulta.4": "Scroll to top and others",
  "daosulta.5": "Experimented with build tools (grunt, gulp): image sprite generation and optimization, css autoprefixer, etc",
  "rg.title": "Portfolio 2017",
  "rg.about": "Single page application. Personal portfolio project. Place for experiments, spending evenings and weekends.",
  "rg.1": "Implemented internationalization with react-intl for English and Russian speakers. With browser language auto detect",
  "rg.2": "Continuous deployment with generous Netlify service",
  "rg.3": "All images are stored in Cloudinary CDN for fast and reliable delivery",
  "rg.4": "Favicon set is stored on Firebase CDN (since I am using them in multiple personal projects)",
  "rg.5": "Webpack: separate sets for development & production (webpack merge)",
  "rg.6": "Responsive components (on init and on resize)",
  "rg.7": "Flexbox for layout instead of grid libraries",
  "rg.8": "px free styles. Only relative units: rem & vw, vh",
  "rg.9": "Local component styles with CSS modules",
  "fr8_shipper_flow.title": "FR8Star Instant Rate",
  "fr8_shipper_flow.about": "Request for quote flow for shippers - an instant freight rate based on live market data including all permits and third-party costs. This flow is an entry point for shippers.",
  "fr8_shipper_flow.1": "Multiple entry points: rate calculator widget, equipment dealers sites (partners) and email campaigns",
  "fr8_shipper_flow.2": "Each screen can work independently, has a URL and is accessible directly from the address bar. The same flow is used for edit mode.",
  "fr8_shipper_flow.3": "Map interactions: custom routes, select pickup/dropoff both from the map and address autocomplete component",
  "fr8_shipper_flow.4": "Different layouts for each shipment type on screen 2",
  "fr8_shipper_flow.5": "Custom warnings for oversized (superloads), international shipping",
  "fr8_shipper_flow.6": "Custom rate cards for partial loads, instantly bookable loads and loads with discount",
  "fr8_shipper_flow.7": "Smart navigation system: based on rfq params UI dispatcher redirects users to a specific screen",
  "load_scanner.title": "FR8Star Freight Finder",
  "load_scanner.about": "FR8Star’s freight finder, also known as a Load Scanner, is a comprehensive tool empowering smaller trucking companies to help them find available truck loads for their fleet.",
  "load_scanner.1": "Section-based layout. Each section works independently. User can add and delete cards",
  "load_scanner.2": "Developed frequent lanes and availabilities components. Reused them later in registration for carriers flow",
  "load_scanner.3": "Notification switcher triggers an update of load matching top section",
  "load_scanner.4": "Smart recalculation of slider component's visibility based on screen width and number of active cards",
  "load_scanner.5": "Custom page state with pre-opened modals based on special query params"
}
